In [1]:
import pandas as pd
age=pd.Series([10,2,15,18],index=["age1","age2",'age3',"age4"])

In [2]:
age.age3

15

In [3]:
filteredage=age[age>10]
filteredage

age3    15
age4    18
dtype: int64

In [4]:
age.values

array([10,  2, 15, 18], dtype=int64)

In [5]:
age.index

Index(['age1', 'age2', 'age3', 'age4'], dtype='object')

In [6]:
age.index=["a1",'a2','a3','a4']
age

a1    10
a2     2
a3    15
a4    18
dtype: int64

In [7]:
import numpy as np
df=np.array([[1,2,3],[12,13,14],[24,25,80],[23,8,21]])
dataset=pd.DataFrame(df)

In [8]:
dataset

    0   1   2
0   1   2   3
1  12  13  14
2  24  25  80
3  23   8  21

In [9]:
dataset=pd.DataFrame(df,index=['s1','s2','s3','s4'],columns=['age','grade1','grade2'])
dataset

    age  grade1  grade2
s1    1       2       3
s2   12      13      14
s3   24      25      80
s4   23       8      21

In [11]:
dataset['grade3']=[9,6,7,10]
dataset

    age  grade1  grade2  grade3
s1    1       2       3       9
s2   12      13      14       6
s3   24      25      80       7
s4   23       8      21      10

In [12]:
a=dataset.loc['s2']
a

age       12
grade1    13
grade2    14
grade3     6
Name: s2, dtype: int64

In [13]:
dataset.loc[1][3]#loc is not integer based hence error

KeyError: 1

In [14]:
dataset.iloc[1][3]

6

In [15]:
dataset.iloc[1,3]

6

In [16]:
dataset.iloc[:,0]

s1     1
s2    12
s3    24
s4    23
Name: age, dtype: int32

In [17]:
dataset

    age  grade1  grade2  grade3
s1    1       2       3       9
s2   12      13      14       6
s3   24      25      80       7
s4   23       8      21      10

In [18]:
dataset.drop('grade1',axis=1)

    age  grade2  grade3
s1    1       3       9
s2   12      14       6
s3   24      80       7
s4   23      21      10

In [19]:
dataset=dataset.replace(12,10)
dataset

    age  grade1  grade2  grade3
s1    1       2       3       9
s2   10      13      14       6
s3   24      25      80       7
s4   23       8      21      10

In [20]:
dataset=dataset.replace({10:12,80:40})
dataset

    age  grade1  grade2  grade3
s1    1       2       3       9
s2   12      13      14       6
s3   24      25      40       7
s4   23       8      21      12

In [21]:
dataset.tail(2)

    age  grade1  grade2  grade3
s3   24      25      40       7
s4   23       8      21      12

In [22]:
dataset.head(3)

    age  grade1  grade2  grade3
s1    1       2       3       9
s2   12      13      14       6
s3   24      25      40       7

In [23]:
dataset.sort_values('grade1',ascending=True)

    age  grade1  grade2  grade3
s1    1       2       3       9
s4   23       8      21      12
s2   12      13      14       6
s3   24      25      40       7

In [24]:
dataset

    age  grade1  grade2  grade3
s1    1       2       3       9
s2   12      13      14       6
s3   24      25      40       7
s4   23       8      21      12

In [25]:
dataset.sort_index(axis=0,ascending=True)

    age  grade1  grade2  grade3
s1    1       2       3       9
s2   12      13      14       6
s3   24      25      40       7
s4   23       8      21      12

In [26]:
dataset.sort_index(axis=0,ascending=False)

    age  grade1  grade2  grade3
s4   23       8      21      12
s3   24      25      40       7
s2   12      13      14       6
s1    1       2       3       9

In [27]:
dataset.sort_index(axis=1,ascending=True)

    age  grade1  grade2  grade3
s1    1       2       3       9
s2   12      13      14       6
s3   24      25      40       7
s4   23       8      21      12

In [28]:
dataset.sort_index(axis=1,ascending=False)

    grade3  grade2  grade1  age
s1       9       3       2    1
s2       6      14      13   12
s3       7      40      25   24
s4      12      21       8   23